In [1]:
import pandas as pd
import numpy as np

In [28]:
data = [1,2,34,45]

df = pd.DataFrame(data)

df

    0
0   1
1   2
2  34
3  45

In [46]:
df['a'] = [' x1 ','x2 ','x3 ','           a         hfghf  x4']
df

    0                               a
0   1                             x1
1   2                             x2
2  34                             x3
3  45             a         hfghf  x4

In [37]:
df1 = df['a'].str.strip(' ')
df1

0                     x1
1                     x2
2                     x3
3    a         hfghf  x4
Name: a, dtype: object

In [59]:
df2=df.rename(index={0:'a',1:'b',2:'c',3:'d'})

In [60]:
df2.describe()

               0
count   4.000000
mean   20.500000
std    22.397917
min     1.000000
25%     1.750000
50%    18.000000
75%    36.750000
max    45.000000

In [63]:
df2[0].argmax()
df2[0].idxmax()

'd'

In [65]:
df1 = pd.DataFrame({'name':['ZhangFei', 'GuanYu', 'a', 'b', 'c'], 'data1':range(5)})
df2 = pd.DataFrame({'name':['ZhangFei', 'GuanYu', 'A', 'B', 'C'], 'data2':range(5)})

In [66]:
df1

       name  data1
0  ZhangFei      0
1    GuanYu      1
2         a      2
3         b      3
4         c      4

In [67]:
df2

       name  data2
0  ZhangFei      0
1    GuanYu      1
2         A      2
3         B      3
4         C      4

In [69]:
df1 = pd.DataFrame(
   ...:     {
   ...:         "A": ["A0", "A1", "A2"],
   ...:         "B": ["B0", "B1", "B2"],
   ...:         "C": ["C0", "C1", "C2"],
   ...:     })
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [71]:
df2 = pd.DataFrame(
   ...:     {
   ...:         "A": ["A3", "A4", "A5"],
   ...:         "B": ["B0", "B1", "B2"],
   ...:         "C": ["C3", "C4", "C5"],
   ...:     })
df2

    A   B   C
0  A3  B0  C3
1  A4  B1  C4
2  A5  B2  C5

In [72]:
pd.merge(df1,df2,on='B')

  A_x   B C_x A_y C_y
0  A0  B0  C0  A3  C3
1  A1  B1  C1  A4  C4
2  A2  B2  C2  A5  C5

In [73]:
pd.concat([df1, df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B0  C3
1  A4  B1  C4
2  A5  B2  C5